In [2]:
import pandas as pd

In [10]:
dict = {
    'name' : ['a','b','a','c','d','c','a','b','a','c','d','c'],
    'rank1' : [1,2,3,4,5,6,7,8,9,10,11,12],
    'rank2' : [20,21,22,23,24,25,26,27,28,29,30,31]
}

df = pd.DataFrame(dict)
df

   name  rank1  rank2
0     a      1     20
1     b      2     21
2     a      3     22
3     c      4     23
4     d      5     24
5     c      6     25
6     a      7     26
7     b      8     27
8     a      9     28
9     c     10     29
10    d     11     30
11    c     12     31

In [22]:
newdf = df.groupby('name')
for i, j in newdf:
    print(i)
    print(j)
    print( )

a
  name  rank1  rank2
0    a      1     20
2    a      3     22
6    a      7     26
8    a      9     28

b
  name  rank1  rank2
1    b      2     21
7    b      8     27

c
   name  rank1  rank2
3     c      4     23
5     c      6     25
9     c     10     29
11    c     12     31

d
   name  rank1  rank2
4     d      5     24
10    d     11     30

In [25]:
newdf.get_group('a')

  name  rank1  rank2
0    a      1     20
2    a      3     22
6    a      7     26
8    a      9     28

In [32]:
print(f'The min data is:\n{newdf.min()}')
print(f'The max data is:\n{newdf.max()}')

The min data is:
      rank1  rank2
name
a         1     20
b         2     21
c         4     23
d         5     24
The max data is:
      rank1  rank2
name
a         9     28
b         8     27
c        12     31
d        11     30